Autodesk.Revit.DB.EmbodiedCarbonAsset.EqualsEmbodiedCarbonOnly(Autodesk.Revit.DB.EmbodiedCarbonAsset)
Determines whether this embodied carbon asset is equal to another, but ignore data from base class.
other:
The embodied carbon asset to compare with this one.
Returns:
True if the given embodied carbon asset is equal to this one, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonAsset.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.EmbodiedCarbonAsset.Name
The name of the EmbodiedCarbon asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonAsset.CarbonCoefficientUnitType
The unit type of Embodied Carbon coefficient (e.g. kgCO₂e/m, kgCO₂e/kg,...)
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonAsset.CarbonCoefficient
Used by Insight, unit is kgCO₂e per length, area, etc., e.g 200.234 kgCO₂e/m
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonAsset.CategoryName
User visible name of category. List of available categories can be retrieved from Sustainability API.
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonAsset.CategoryId
Internal identifier of category. List of available categories can be retrieved from Sustainability API.
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonAsset.ProviderName
User visible name of provider. List of available providers can be retrieved from Sustainability API.
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonAsset.ProviderId
Internal identifier of provider, which provide embodied carbon data. List of available providers can be retrieved from Sustainability API.
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonAsset.#ctor(System.String)
Constructs an instance of EmbodiedCarbonAsset.
name:
The name of the asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.EmbodiedCarbonAsset
Represents the properties of a material pertinent to embodied carbon calculations.
Since:
2027